# 1)написати прогу яка вибирає зі введеної строки цифри і виводить їх через кому,
# # наприклад:
# from math import trunc
# st = 'as 23 fdfdg544' #введена строка
# y = ''
# i = 0
# while i < len(st):
#     if st[i].isdigit() == True:
#         y = y + st[i]
#     i+=1
# # y = str(y)
# print(', '.join(y))
#
# # #################################################################################
#
# # 2)написати прогу яка вибирає зі введеної строки числа і виводить їх
# # так як вони написані
# # наприклад:
# #   23, 544, 34              #вивело в консолі
# st2 = 'as 23 fdfdg544 34' #введена строка
# res2 = []
# for ch2 in st2:
#     res2.append(ch2 if ch2.isdigit() else ' ')
#
# res2 = ''.join(res2)
# res2 = res2.split()
# res2 = ', '.join(res2)
# print(res2)
#
# # #################################################################################
# #
# # list comprehension
# #
# # 1)є строка:
# # greeting = 'Hello, world'
# # записати кожний символ як окремий елемент списку і зробити його заглавним:
# # ['H', 'E', 'L', 'L', 'O', ',', ' ', 'W', 'O', 'R', 'L', 'D']
#
# greeting = 'Hello, world'
# li = []
# for i3 in greeting:
#     li.append(i3.swapcase())
# print(li)
#
# ####################################################################################
# #
# # 2) з диапозону від 0-50 записати тільки не парні числа при цьому піднести їх до квадрату
# # приклад:
# # [0, 1, 4, 9, 16, 25, 36, 49, 64, 81, 100, 121, 144, 169, 196, 225, 256, 289, 324, ...]
# #
# l2 = []
# num = 0
# while num <= 50:
#     if num%2 != 0:
#         l2.append(num**2)
#     num += 1
# print(l2)
#
# # function
# #
# # - створити функцію яка виводить ліст
# a = [1,4,-6]
# for a1 in a:
#     print(a1)
# # - створити функцію яка приймає три числа та виводить та повертає найбільше.
# m = 0
# maxx = 0
# while m < len(a):
#     if maxx < a[m]:
#         maxx = a[m]
#     m += 1
# print(maxx)
# # - створити функцію яка приймає будь-яку кількість чисел, повертає найменьше,
# #           а виводить найбільше
#
#
#
# # - створити функцію яка повертає найбільше число з ліста
# m2 = 0
# maxx2 = 0
# while m2 < len(a):
#     if maxx2 < a[m2]:
#         maxx2 = a[m2]
#     m2 += 1
# print(maxx2)
# #print(max(a))
# #########################################################
# # - створити функцію яка повертає найменьше число з ліста
# m3 = 0
# minn = 0
# while m3 < len(a):
#     if minn < a[m3] & minn !=0:
#         minn = a[m3]
#     else:
#         minn = a[m3]
#     m3 += 1
# print(minn)
# #print(min(a))
# # - створити функцію яка приймає ліст чисел та складає значення елементів ліста
# #                               та повертає його.
# print(sum(a))
# # - створити функцію яка приймає ліст чисел та повертає середнє арифметичне
# #                               його значень.
# print(sum(a)/len(a))
# #
# #
#
#
# ################################################################################################
# 1)Дан list:
l = [22, 3,5,2,8,2,-23, 8,23,5]
#   - знайти мін число
def min_of_list(): print(min(l))
#   - видалити усі дублікати
def duplicate():
    copy = l.copy()
    print(list(set(copy)))
#   - замінити кожне 4-те значення на 'X'
def to_x():
    copy = l.copy()
    print(['X' if not (i+1)%4 else item for i, item in enumerate(copy)])
# 2) вивести на екран пустий квадрат з "*" сторона якого вказана як агрумент функції
def square(n):
    for i in range(n):
        if i == 0 or i == n-1:
            print('*  '*n)
        else:
            print('*'+'   '*(n-2)+'  *')
# 3) вывести табличку множення за допомогою цикла while
def multitable():
    size = 9
    i = 1
    while i<= size:
        j = 1
        while j <= size:
            res = i*j
            print('' if res//10 else ' ', end=' ')
            print(res, end='')
            j+=1
        print()
        i+=1
# 4) переробити це завдання під меню
while True:
    print('1) знайти мін число')
    print('2) видалити усі дублікати')
    print("3) замінити кожне 4-те значення на 'X'")
    print('4) вивести на екран пустий квадрат з "*" сторона якого вказана як агрумент функції')
    print('5) вывести табличку множення за допомогою цикла while')
    print('9) Exit')

    choice = input('Make a choice: ')

    if choice == '1':
        min_of_list()
    elif choice == '2':
        duplicate()
    elif choice == '3':
        to_x()
    elif choice == '4':
        square(8)
    elif choice == '5':
        multitable()
    elif choice == '9':
        break
